# EA_DataAccSetInt

## Description
Set integer value to the object, associated to the accessory index.

```pascal
PROCEDURE EA_DataAccSetInt(
				acc        : INTEGER;
				valueIndex : INTEGER;
				value      : INTEGER);
```

```python
def vs.EA_DataAccSetInt(acc, valueIndex, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |
|valueIndex|INTEGER|   |
|value|INTEGER|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library